// 1 - Дано натуральное число n. Выведите все числа от 1 до n.

// let numb = function (n) {
//     for (let i = 1; i <= n; i++) {
//         const argument = n[i];
//         console.log(i)
//     }
// }
// numb(5)

// 2 - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.

 // let numb = function (ar,n) {
 //     for (let i = ar; i <= n; i++) {
 //         const argument = n[i];
 //         console.log(i)
 //     }
 // }
 // numb(5,15)

// 3 -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]

// function array(arr, new_index) {
//     for (let i = 0; i < arr.length; i++) {
//         let arrElement = console.log(arr[i+new_index])
//     }
//     for (let i = 0; i < new_index; i++) {
//         let arrElement = console.log(arr[i])
//
//     }
// }
// array([9, 8, 0, 4], 3)

// Тут чучуть рурожопства, могли б ви порадити як би це зробити простіше. Але працює

// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]

